# Import and Export Files

# Challenge 0 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [ ]:
import mysql.connector

In [ ]:
# your code here
mydb = mysql.connector.connect(
  host="127.0.0.1",
  user="sidnei",
  password="andrade2305",
    database = 'sakila'
    
)
cursor = mydb.cursor()

# Challenge 1 - Working with JSON files
Import the pandas library.

In [ ]:
# your code here
import pandas as pd

In the next cell, load the data in nasa.json in the data folder and load it into a pandas dataframe. Name the dataframe nasa.

In [ ]:
# your code here
nasa = pd.read_json('nasa.json')

Now that we have loaded the data, let's examine it using the head() function.

In [ ]:
# your code here
nasa.head()

   :@computed_region_cbhk_fwbd  ...                     year
0                          NaN  ...  1880-01-01T00:00:00.000
1                          NaN  ...  1951-01-01T00:00:00.000
2                          NaN  ...  1952-01-01T00:00:00.000
3                          NaN  ...  1976-01-01T00:00:00.000
4                          NaN  ...  1902-01-01T00:00:00.000

[5 rows x 12 columns]

####  The value_counts() function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the value_counts() function to determine the frequency of all types of asteroid landings by applying the function to the fall column.

In [ ]:
# your code here
nasa.value_counts('fall')

fall
Fell     996
Found      4
dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the orient=records argument and name the file nasa-output.json. Remember to save the file inside the data folder.

In [ ]:
# your code here
nasa.to_json('nasa-output.json',orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

Import the pandas library

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [ ]:
#Your pandas import here
import pandas as pd

In [ ]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [ ]:
# Your code here:
shuttle = pd.read_csv(tst_url,sep='\t',names=cols )

Let's verify that this worked by looking at the `head()` function.

In [ ]:
# Your code here:
shuttle.head()

                         time  rad_flow  fpv_close  ...  bpv_close  bpv_open  class
0  55 0 81 0 -6 11 25 88 64 4       NaN        NaN  ...        NaN       NaN    NaN
1   56 0 96 0 52 -4 40 44 4 4       NaN        NaN  ...        NaN       NaN    NaN
2  50 -1 89 -7 50 0 39 40 2 1       NaN        NaN  ...        NaN       NaN    NaN
3  53 9 79 0 42 -2 25 37 12 4       NaN        NaN  ...        NaN       NaN    NaN
4   55 2 82 0 54 -6 26 28 2 1       NaN        NaN  ...        NaN       NaN    NaN

[5 rows x 9 columns]

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [ ]:
# Your code here:
shuttle.to_csv('shuttle.csv',index=False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [ ]:
# Your code here:

astronaut = pd.read_excel('astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [ ]:
# Your code here:
astronaut.head()

               Name    Year  ...  Death Date Death Mission
0   Joseph M. Acaba  2004.0  ...         NaT           NaN
1    Loren W. Acton     NaN  ...         NaT           NaN
2  James C. Adamson  1984.0  ...         NaT           NaN
3   Thomas D. Akers  1987.0  ...         NaT           NaN
4       Buzz Aldrin  1963.0  ...         NaT           NaN

[5 rows x 19 columns]

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [ ]:
# Your code here:
astronaut.value_counts('Undergraduate Major')

Undergraduate Major
Physics                           35
Aerospace Engineering             33
Mechanical Engineering            30
Aeronautical Engineering          28
Electrical Engineering            23
                                  ..
Earth Sciences                     1
Earth & Planetary Science          1
Music                              1
Computer & Systems Engineering     1
Accounting                         1
Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [ ]:
# Your code here:
astronaut.to_csv('astronaut1.csv', sep='\t',index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [ ]:
# Your code here: